tap "jandedobbeleer/oh-my-posh"
brew "ruff"
brew "uv"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.test-adapter-converter"
vscode "naumovs.color-highlight"
vscode "pamaron.pytest-runner"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
