anysphere.cursorpyright
ardonplay.vscode-jetbrains-icon-theme
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
hashicorp.terraform
hbenl.vscode-test-explorer
humao.rest-client
kavod-io.vscode-jest-test-adapter
littlefoxteam.vscode-python-test-adapter
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-vscode.test-adapter-converter
naumovs.color-highlight
septwong.vscode-webstorm-theme
tamasfe.even-better-toml
usernamehw.errorlens
vitest.explorer
vscodevim.vim
