bradlc.vscode-tailwindcss
chadalen.vscode-jetbrains-icon-theme
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
eenaree.webstorm-new-dark
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
hashicorp.terraform
hbenl.vscode-test-explorer
humao.rest-client
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.test-adapter-converter
naumovs.color-highlight
pamaron.pytest-runner
tamasfe.even-better-toml
usernamehw.errorlens
vitest.explorer
vscodevim.vim
